In [ ]:
#Importing Libraries

import numpy as np
import pandas as pd

**Reading the data**

In [ ]:
  data = pd.read_csv ("/content/Data-cleaning-for-beginners-using-pandas.csv")
  print(data)

    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       India,In         1999       TRUE
1       1  66.0   $55k-$66k     3.5    New York,Ny         2002       TRUE
2       2   NaN   $77k-$89k    -1.0    New York,Ny           -1         -1
3       3  64.0   $44k-$99k     4.4       India In         1988         -1
4       4  25.0   $44k-$99k     6.4  Australia Aus         2002         -1
5       5  44.0   $77k-$89k     1.4       India,In         1999       TRUE
6       6  21.0   $44k-$99k     0.0    New York,Ny           -1         -1
7       7  44.0   $44k-$99k    -1.0  Australia Aus           -1         -1
8       8  35.0   $44k-$99k     5.4    New York,Ny           -1         -1
9       9  22.0   $44k-$99k     7.7       India,In           -1       TRUE
10     10  55.0   $10k-$49k     5.4       India,In         2008       TRUE
11     11  44.0   $10k-$49k     6.7       India,In         2009         -1
12     12   NaN   $44k-$99k     0.0       India,In         1999         -1
13     13  25.0   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14     14  66.0   $44k-$99k     4.0  Australia Aus         2020       TRUE
15     15  44.0  $88k-$101k     3.0  Australia Aus         1999         -1
16     16  19.0   $19k-$40k     4.5       India,In         1984         -1
17     17   NaN   $44k-$99k     5.3    New York,Ny         1943       TRUE
18     18  35.0   $44k-$99k     6.7    New York,Ny         1954       TRUE
19     19  32.0   $44k-$99k     3.3    New York,Ny         1955       TRUE
20     20   NaN   $44k-$99k     5.7    New York,Ny         1944       TRUE
21     21  35.0   $44k-$99k     5.0    New York,Ny         1946         -1
22     22  19.0   $55k-$66k     7.8    New York,Ny         1988       TRUE
23     23   NaN   $44k-$99k     2.4    New York,Ny         1999       TRUE
24     24  13.0   $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0   $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   NaN   $55k-$66k     NaN       India,In         1934       TRUE
27     27  52.0   $44k-$99k     5.4       India,In         1935         -1
28     28   NaN   $39k-$88k     3.4  Australia Aus         1932         -1

**Q1) Missing Values: Are there any missing values in the dataset, and if so, how should they be handled for each indicator?** bold text

In [ ]:
data.isnull().sum()

Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64

In [ ]:
#To fill the null values for age row
avg_age = data['Age'].mean()
print(avg_age)

# To fill the null values for the rating row
avg_rating = data['Rating'].mean()
print(avg_rating)

39.03448275862069
3.528571428571429

In [ ]:
# Now we have to fill the missing values with the mean
data['Age'] = data.Age.fillna(avg_age)
data['Age'] = data.Age.round(decimals=1)

In [ ]:
# Now lets check how the missing values are replaced
data['Age']

0     44.0
1     66.0
2     39.0
3     64.0
4     25.0
5     44.0
6     21.0
7     44.0
8     35.0
9     22.0
10    55.0
11    44.0
12    39.0
13    25.0
14    66.0
15    44.0
16    19.0
17    39.0
18    35.0
19    32.0
20    39.0
21    35.0
22    19.0
23    39.0
24    13.0
25    55.0
26    39.0
27    52.0
28    39.0
Name: Age, dtype: float64

In [ ]:
#Now to we have to fill the missing values with the mean in rating row

data['Rating'] = data.Rating.fillna(avg_rating)
data['Rating'] = data.Rating.round(decimals=1)

In [ ]:
# Now lets check if all the missing vales are replaced or not
data['Rating']

0     5.4
1     3.5
2    -1.0
3     4.4
4     6.4
5     1.4
6     0.0
7    -1.0
8     5.4
9     7.7
10    5.4
11    6.7
12    0.0
13   -1.0
14    4.0
15    3.0
16    4.5
17    5.3
18    6.7
19    3.3
20    5.7
21    5.0
22    7.8
23    2.4
24   -1.0
25    0.0
26    NaN
27    5.4
28    3.4
Name: Rating, dtype: float64

Q2) **Data Types: What are the data types of each indicator, and do they align with their expected types (e.g., numerical, categorical)?**

In [ ]:
# Firstly lets check the datatypes of the whole dataset
print(data.dtypes)

Index            int64
Age            float64
Salary          object
Rating         float64
Location        object
Established      int64
Easy Apply      object
dtype: object

In [ ]:
data_types = data.dtypes

for column, dtype in data_types.items():
    print(f"{column}: {dtype}")

    if data[column].dtype == 'object':
        print(f"Expected Type: Categorical")
    elif data[column].dtype == 'float64':
        print(f"Expected Type: Numerical")


    print()

Index: int64

Age: float64
Expected Type: Numerical

Salary: object
Expected Type: Categorical

Rating: float64
Expected Type: Numerical

Location: object
Expected Type: Categorical

Established: int64

Easy Apply: object
Expected Type: Categorical

**Q3) Outliers: Identify potential outliers in numerical indicators (e.g., Age, Salary, Rating). Should outliers be removed or adjusted?**

In [ ]:
z_score_threshold = 3

z_scores = np.abs((data[['Age', 'Salary', 'Rating']] - data[['Age', 'Salary', 'Rating']].mean()) / data[['Age', 'Salary', 'Rating']].std())

data_no_outliers = data[(z_scores <= z_score_threshold).all(axis=1)]

print("Dataset after removing outliers:")
print(data_no_outliers)

Dataset after removing outliers:
Empty DataFrame
Columns: [Index, Age, Salary, Rating, Location, Established, Easy Apply]
Index: []

<ipython-input-38-0c291d66372d>:3: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  z_scores = np.abs((data[['Age', 'Salary', 'Rating']] - data[['Age', 'Salary', 'Rating']].mean()) / data[['Age', 'Salary', 'Rating']].std())
<ipython-input-38-0c291d66372d>:3: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  z_scores = np.abs((data[['Age', 'Salary', 'Rating']] - data[['Age', 'Salary', 'Rating']].mean()) / data[['Age', 'Salary', 'Rating']].std())

**Q4). Salary Formatting: Examine the format of the Salary column. Does it require any formatting or standardization for consistent analysis?**

In [ ]:
data['Salary']

0      $44k-$99k
1      $55k-$66k
2      $77k-$89k
3      $44k-$99k
4      $44k-$99k
5      $77k-$89k
6      $44k-$99k
7      $44k-$99k
8      $44k-$99k
9      $44k-$99k
10     $10k-$49k
11     $10k-$49k
12     $44k-$99k
13     $44k-$99k
14     $44k-$99k
15    $88k-$101k
16     $19k-$40k
17     $44k-$99k
18     $44k-$99k
19     $44k-$99k
20     $44k-$99k
21     $44k-$99k
22     $55k-$66k
23     $44k-$99k
24     $44k-$99k
25     $44k-$99k
26     $55k-$66k
27     $44k-$99k
28     $39k-$88k
Name: Salary, dtype: object

In [ ]:
unique_salary_values = data['Salary'].unique()

print("Unique values in the 'Salary' column:")
print(unique_salary_values)

pattern_counts = data['Salary'].value_counts()

print("\nCounts of each unique pattern in the 'Salary' column:")
print(pattern_counts)


missing_salary_values = data['Salary'].isnull().sum()

print("\nMissing values in the 'Salary' column:", missing_salary_values)

Unique values in the 'Salary' column:
['$44k-$99k' '$55k-$66k' '$77k-$89k' '$10k-$49k' '$88k-$101k' '$19k-$40k'
 '$39k-$88k']

Counts of each unique pattern in the 'Salary' column:
$44k-$99k     19
$55k-$66k      3
$77k-$89k      2
$10k-$49k      2
$88k-$101k     1
$19k-$40k      1
$39k-$88k      1
Name: Salary, dtype: int64

Missing values in the 'Salary' column: 0

Q**5) Location Standardization: Check the consistency of location entries. Do they need standardization, and how can this be achieved?**

In [ ]:
unique_locations = data['Location'].unique()

print("Unique values in the 'Location' column:")
print(unique_locations)

data['Location'] = data['Location'].str.lower()

print("\nDataset after standardizing 'Location' entries:")
print(data)

Unique values in the 'Location' column:
['India,In' 'New York,Ny' 'India In' 'Australia Aus']

Dataset after standardizing 'Location' entries:
    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       india,in         1999       TRUE
1       1  66.0   $55k-$66k     3.5    new york,ny         2002       TRUE
2       2  39.0   $77k-$89k    -1.0    new york,ny           -1         -1
3       3  64.0   $44k-$99k     4.4       india in         1988         -1
4       4  25.0   $44k-$99k     6.4  australia aus         2002         -1
5       5  44.0   $77k-$89k     1.4       india,in         1999       TRUE
6       6  21.0   $44k-$99k     0.0    new york,ny           -1         -1
7       7  44.0   $44k-$99k    -1.0  australia aus           -1         -1
8       8  35.0   $44k-$99k     5.4    new york,ny           -1         -1
9       9  22.0   $44k-$99k     7.7       india,in           -1       TRUE
10     10  55.0   $10k-$49k     5.4       india,in         2008       TRUE
11     11  44.0   $10k-$49k     6.7       india,in         2009         -1
12     12  39.0   $44k-$99k     0.0       india,in         1999         -1
13     13  25.0   $44k-$99k    -1.0  australia aus         2019       TRUE
14     14  66.0   $44k-$99k     4.0  australia aus         2020       TRUE
15     15  44.0  $88k-$101k     3.0  australia aus         1999         -1
16     16  19.0   $19k-$40k     4.5       india,in         1984         -1
17     17  39.0   $44k-$99k     5.3    new york,ny         1943       TRUE
18     18  35.0   $44k-$99k     6.7    new york,ny         1954       TRUE
19     19  32.0   $44k-$99k     3.3    new york,ny         1955       TRUE
20     20  39.0   $44k-$99k     5.7    new york,ny         1944       TRUE
21     21  35.0   $44k-$99k     5.0    new york,ny         1946         -1
22     22  19.0   $55k-$66k     7.8    new york,ny         1988       TRUE
23     23  39.0   $44k-$99k     2.4    new york,ny         1999       TRUE
24     24  13.0   $44k-$99k    -1.0    new york,ny         1987         -1
25     25  55.0   $44k-$99k     0.0  australia aus         1980       TRUE
26     26  39.0   $55k-$66k     NaN       india,in         1934       TRUE
27     27  52.0   $44k-$99k     5.4       india,in         1935         -1
28     28  39.0   $39k-$88k     3.4  australia aus         1932         -1

**Q6. Established Column: Explore the Established column. Are there any inconsistencies or anomalies that need to be addressed?**

**Q7. Easy Apply Indicator: Analyze the Easy Apply column. Does it contain boolean values or need transformation for better analysis?**

In [ ]:
unique_easy_apply_values = data['Easy Apply'].unique()

print("Unique values in the 'Easy Apply' column:")
print(unique_easy_apply_values)

easy_apply_data_type = data['Easy Apply'].dtype

print("\nData type of the 'Easy Apply' column:", easy_apply_data_type)

if easy_apply_data_type != bool:
    data['Easy Apply'] = data['Easy Apply'].map({'TRUE': True, 'FALSE': False})

print("after potential transformation")
print(data)

Unique values in the 'Easy Apply' column:
[True nan]

Data type of the 'Easy Apply' column: object
after potential transformation
    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       india,in         1999        NaN
1       1  66.0   $55k-$66k     3.5    new york,ny         2002        NaN
2       2  39.0   $77k-$89k    -1.0    new york,ny           -1        NaN
3       3  64.0   $44k-$99k     4.4       india in         1988        NaN
4       4  25.0   $44k-$99k     6.4  australia aus         2002        NaN
5       5  44.0   $77k-$89k     1.4       india,in         1999        NaN
6       6  21.0   $44k-$99k     0.0    new york,ny           -1        NaN
7       7  44.0   $44k-$99k    -1.0  australia aus           -1        NaN
8       8  35.0   $44k-$99k     5.4    new york,ny           -1        NaN
9       9  22.0   $44k-$99k     7.7       india,in           -1        NaN
10     10  55.0   $10k-$49k     5.4       india,in         2008        NaN
11     11  44.0   $10k-$49k     6.7       india,in         2009        NaN
12     12  39.0   $44k-$99k     0.0       india,in         1999        NaN
13     13  25.0   $44k-$99k    -1.0  australia aus         2019        NaN
14     14  66.0   $44k-$99k     4.0  australia aus         2020        NaN
15     15  44.0  $88k-$101k     3.0  australia aus         1999        NaN
16     16  19.0   $19k-$40k     4.5       india,in         1984        NaN
17     17  39.0   $44k-$99k     5.3    new york,ny         1943        NaN
18     18  35.0   $44k-$99k     6.7    new york,ny         1954        NaN
19     19  32.0   $44k-$99k     3.3    new york,ny         1955        NaN
20     20  39.0   $44k-$99k     5.7    new york,ny         1944        NaN
21     21  35.0   $44k-$99k     5.0    new york,ny         1946        NaN
22     22  19.0   $55k-$66k     7.8    new york,ny         1988        NaN
23     23  39.0   $44k-$99k     2.4    new york,ny         1999        NaN
24     24  13.0   $44k-$99k    -1.0    new york,ny         1987        NaN
25     25  55.0   $44k-$99k     0.0  australia aus         1980        NaN
26     26  39.0   $55k-$66k     NaN       india,in         1934        NaN
27     27  52.0   $44k-$99k     5.4       india,in         1935        NaN
28     28  39.0   $39k-$88k     3.4  australia aus         1932        NaN

**Q8. Rating Range: Investigate the range of values in the Rating column. Does it fall within expected rating scales, and how should outliers be treated?**

**Q9. Age Distribution:Check the distribution of values in the Age column. Are there any unusual entries, and how might they impact analysis?**

In [ ]:
age_summary = data['Age'].describe()

print("Summary statistics for the 'Age' column:")
print(age_summary)

unique_age_values = data['Age'].unique()
age_counts = data['Age'].value_counts()

print("\nUnique values in the 'Age' column:")
print(unique_age_values)

print("\nCounts for each unique age value:")
print(age_counts)

Summary statistics for the 'Age' column:
count    29.000000
mean     39.034483
std      13.973145
min      13.000000
25%      32.000000
50%      39.000000
75%      44.000000
max      66.000000
Name: Age, dtype: float64

Unique values in the 'Age' column:
[44. 66. 39. 64. 25. 21. 35. 22. 55. 19. 32. 13. 52.]

Counts for each unique age value:
39.0    7
44.0    5
35.0    3
66.0    2
25.0    2
55.0    2
19.0    2
64.0    1
21.0    1
22.0    1
32.0    1
13.0    1
52.0    1
Name: Age, dtype: int64

**Q10. Handling Special Characters: Examine all text-based columns (e.g., Location). Are there special characters or inconsistencies that need cleaning?**

In [ ]:
text_columns = ['Location']


for column in text_columns:
    unique_values = data[column].unique()
    print(f"\nUnique values in the '{column}' column:")
    print(unique_values)


data['Location'] = data['Location'].str.replace(r'[^a-zA-Z0-9\s,]', '', regex=True)
data['Location'] = data['Location'].str.strip()


print("\nDataset after cleaning text-based columns:")
print(data)

Unique values in the 'Location' column:
['india,in' 'new york,ny' 'india in' 'australia aus']

Dataset after cleaning text-based columns:
    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       india,in         1999        NaN
1       1  66.0   $55k-$66k     3.5    new york,ny         2002        NaN
2       2  39.0   $77k-$89k    -1.0    new york,ny           -1        NaN
3       3  64.0   $44k-$99k     4.4       india in         1988        NaN
4       4  25.0   $44k-$99k     6.4  australia aus         2002        NaN
5       5  44.0   $77k-$89k     1.4       india,in         1999        NaN
6       6  21.0   $44k-$99k     0.0    new york,ny           -1        NaN
7       7  44.0   $44k-$99k    -1.0  australia aus           -1        NaN
8       8  35.0   $44k-$99k     5.4    new york,ny           -1        NaN
9       9  22.0   $44k-$99k     7.7       india,in           -1        NaN
10     10  55.0   $10k-$49k     5.4       india,in         2008        NaN
11     11  44.0   $10k-$49k     6.7       india,in         2009        NaN
12     12  39.0   $44k-$99k     0.0       india,in         1999        NaN
13     13  25.0   $44k-$99k    -1.0  australia aus         2019        NaN
14     14  66.0   $44k-$99k     4.0  australia aus         2020        NaN
15     15  44.0  $88k-$101k     3.0  australia aus         1999        NaN
16     16  19.0   $19k-$40k     4.5       india,in         1984        NaN
17     17  39.0   $44k-$99k     5.3    new york,ny         1943        NaN
18     18  35.0   $44k-$99k     6.7    new york,ny         1954        NaN
19     19  32.0   $44k-$99k     3.3    new york,ny         1955        NaN
20     20  39.0   $44k-$99k     5.7    new york,ny         1944        NaN
21     21  35.0   $44k-$99k     5.0    new york,ny         1946        NaN
22     22  19.0   $55k-$66k     7.8    new york,ny         1988        NaN
23     23  39.0   $44k-$99k     2.4    new york,ny         1999        NaN
24     24  13.0   $44k-$99k    -1.0    new york,ny         1987        NaN
25     25  55.0   $44k-$99k     0.0  australia aus         1980        NaN
26     26  39.0   $55k-$66k     NaN       india,in         1934        NaN
27     27  52.0   $44k-$99k     5.4       india,in         1935        NaN
28     28  39.0   $39k-$88k     3.4  australia aus         1932        NaN

Q11. Data Integrity: Ensure data integrity by cross-referencing entries. For instance, does the Established column align with the Age column?

In [ ]:
misaligned_entries = data[data['Age'] != -1]  # Assuming -1 is used for missing values in 'Age'
misaligned_entries = misaligned_entries[(misaligned_entries['Established'] != -1) & (misaligned_entries['Age'] - misaligned_entries['Established'] < 0)]

print("Entries where 'Age' and 'Established' columns don't align:")
print(misaligned_entries[['Age', 'Established']])

data.loc[data['Age'] == -1, 'Age'] = data['Established'] - data['Established'].min()


print("\nDataset after handling misaligned entries:")
print(data)

Entries where 'Age' and 'Established' columns don't align:
     Age  Established
0   44.0         1999
1   66.0         2002
3   64.0         1988
4   25.0         2002
5   44.0         1999
10  55.0         2008
11  44.0         2009
12  39.0         1999
13  25.0         2019
14  66.0         2020
15  44.0         1999
16  19.0         1984
17  39.0         1943
18  35.0         1954
19  32.0         1955
20  39.0         1944
21  35.0         1946
22  19.0         1988
23  39.0         1999
24  13.0         1987
25  55.0         1980
26  39.0         1934
27  52.0         1935
28  39.0         1932

Dataset after handling misaligned entries:
    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       india,in         1999        NaN
1       1  66.0   $55k-$66k     3.5    new york,ny         2002        NaN
2       2  39.0   $77k-$89k    -1.0    new york,ny           -1        NaN
3       3  64.0   $44k-$99k     4.4       india in         1988        NaN
4       4  25.0   $44k-$99k     6.4  australia aus         2002        NaN
5       5  44.0   $77k-$89k     1.4       india,in         1999        NaN
6       6  21.0   $44k-$99k     0.0    new york,ny           -1        NaN
7       7  44.0   $44k-$99k    -1.0  australia aus           -1        NaN
8       8  35.0   $44k-$99k     5.4    new york,ny           -1        NaN
9       9  22.0   $44k-$99k     7.7       india,in           -1        NaN
10     10  55.0   $10k-$49k     5.4       india,in         2008        NaN
11     11  44.0   $10k-$49k     6.7       india,in         2009        NaN
12     12  39.0   $44k-$99k     0.0       india,in         1999        NaN
13     13  25.0   $44k-$99k    -1.0  australia aus         2019        NaN
14     14  66.0   $44k-$99k     4.0  australia aus         2020        NaN
15     15  44.0  $88k-$101k     3.0  australia aus         1999        NaN
16     16  19.0   $19k-$40k     4.5       india,in         1984        NaN
17     17  39.0   $44k-$99k     5.3    new york,ny         1943        NaN
18     18  35.0   $44k-$99k     6.7    new york,ny         1954        NaN
19     19  32.0   $44k-$99k     3.3    new york,ny         1955        NaN
20     20  39.0   $44k-$99k     5.7    new york,ny         1944        NaN
21     21  35.0   $44k-$99k     5.0    new york,ny         1946        NaN
22     22  19.0   $55k-$66k     7.8    new york,ny         1988        NaN
23     23  39.0   $44k-$99k     2.4    new york,ny         1999        NaN
24     24  13.0   $44k-$99k    -1.0    new york,ny         1987        NaN
25     25  55.0   $44k-$99k     0.0  australia aus         1980        NaN
26     26  39.0   $55k-$66k     NaN       india,in         1934        NaN
27     27  52.0   $44k-$99k     5.4       india,in         1935        NaN
28     28  39.0   $39k-$88k     3.4  australia aus         1932        NaN

**Q12. Easy Apply Transformation: If the Easy Apply column contains non-boolean values, how can it be transformed into a usable format?**

In [ ]:
unique_easy_apply_values = data['Easy Apply'].unique()

print("Unique values in the 'Easy Apply' column:")
print(unique_easy_apply_values)

easy_apply_data_type = data['Easy Apply'].dtype

print("\nData type of the 'Easy Apply' column:", easy_apply_data_type)

if easy_apply_data_type != bool:
    data['Easy Apply'] = data['Easy Apply'].map({'TRUE': True, 'FALSE': False})

print("\nDataset after transforming 'Easy Apply' column:")
print(data)

Unique values in the 'Easy Apply' column:
[nan]

Data type of the 'Easy Apply' column: object

Dataset after transforming 'Easy Apply' column:
    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       india,in         1999        NaN
1       1  66.0   $55k-$66k     3.5    new york,ny         2002        NaN
2       2  39.0   $77k-$89k    -1.0    new york,ny           -1        NaN
3       3  64.0   $44k-$99k     4.4       india in         1988        NaN
4       4  25.0   $44k-$99k     6.4  australia aus         2002        NaN
5       5  44.0   $77k-$89k     1.4       india,in         1999        NaN
6       6  21.0   $44k-$99k     0.0    new york,ny           -1        NaN
7       7  44.0   $44k-$99k    -1.0  australia aus           -1        NaN
8       8  35.0   $44k-$99k     5.4    new york,ny           -1        NaN
9       9  22.0   $44k-$99k     7.7       india,in           -1        NaN
10     10  55.0   $10k-$49k     5.4       india,in         2008        NaN
11     11  44.0   $10k-$49k     6.7       india,in         2009        NaN
12     12  39.0   $44k-$99k     0.0       india,in         1999        NaN
13     13  25.0   $44k-$99k    -1.0  australia aus         2019        NaN
14     14  66.0   $44k-$99k     4.0  australia aus         2020        NaN
15     15  44.0  $88k-$101k     3.0  australia aus         1999        NaN
16     16  19.0   $19k-$40k     4.5       india,in         1984        NaN
17     17  39.0   $44k-$99k     5.3    new york,ny         1943        NaN
18     18  35.0   $44k-$99k     6.7    new york,ny         1954        NaN
19     19  32.0   $44k-$99k     3.3    new york,ny         1955        NaN
20     20  39.0   $44k-$99k     5.7    new york,ny         1944        NaN
21     21  35.0   $44k-$99k     5.0    new york,ny         1946        NaN
22     22  19.0   $55k-$66k     7.8    new york,ny         1988        NaN
23     23  39.0   $44k-$99k     2.4    new york,ny         1999        NaN
24     24  13.0   $44k-$99k    -1.0    new york,ny         1987        NaN
25     25  55.0   $44k-$99k     0.0  australia aus         1980        NaN
26     26  39.0   $55k-$66k     NaN       india,in         1934        NaN
27     27  52.0   $44k-$99k     5.4       india,in         1935        NaN
28     28  39.0   $39k-$88k     3.4  australia aus         1932        NaN

**Q13. Location Accuracy: Assess the accuracy of location entries. Are there misspelled or ambiguous locations that require correction?**

**Q14. Handling Categorical Data: For categorical indicators, consider encoding or transforming them into a format suitable for analysis**

In [ ]:
data_types = data.dtypes

print("Data types of each column:")
print(data_types)

categorical_columns = data.select_dtypes(include=['object']).columns

print("\nCategorical columns:")
print(categorical_columns)


data_encoded = pd.get_dummies(data, columns=categorical_columns, drop_first=True)


print("\nDataset after one-hot encoding categorical columns:")
print(data_encoded)

Data types of each column:
Index            int64
Age            float64
Salary          object
Rating         float64
Location        object
Established      int64
Easy Apply      object
dtype: object

Categorical columns:
Index(['Salary', 'Location', 'Easy Apply'], dtype='object')

Dataset after one-hot encoding categorical columns:
    Index   Age  Rating  Established  Salary_$19k-$40k  Salary_$39k-$88k  \
0       0  44.0     5.4         1999                 0                 0
1       1  66.0     3.5         2002                 0                 0
2       2  39.0    -1.0           -1                 0                 0
3       3  64.0     4.4         1988                 0                 0
4       4  25.0     6.4         2002                 0                 0
5       5  44.0     1.4         1999                 0                 0
6       6  21.0     0.0           -1                 0                 0
7       7  44.0    -1.0           -1                 0                 0
8       8  35.0     5.4           -1                 0                 0
9       9  22.0     7.7           -1                 0                 0
10     10  55.0     5.4         2008                 0                 0
11     11  44.0     6.7         2009                 0                 0
12     12  39.0     0.0         1999                 0                 0
13     13  25.0    -1.0         2019                 0                 0
14     14  66.0     4.0         2020                 0                 0
15     15  44.0     3.0         1999                 0                 0
16     16  19.0     4.5         1984                 1                 0
17     17  39.0     5.3         1943                 0                 0
18     18  35.0     6.7         1954                 0                 0
19     19  32.0     3.3         1955                 0                 0
20     20  39.0     5.7         1944                 0                 0
21     21  35.0     5.0         1946                 0                 0
22     22  19.0     7.8         1988                 0                 0
23     23  39.0     2.4         1999                 0                 0
24     24  13.0    -1.0         1987                 0                 0
25     25  55.0     0.0         1980                 0                 0
26     26  39.0     NaN         1934                 0                 0
27     27  52.0     5.4         1935                 0                 0
28     28  39.0     3.4         1932                 0                 1

    Salary_$44k-$99k  Salary_$55k-$66k  Salary_$77k-$89k  Salary_$88k-$101k  \
0                  1                 0                 0                  0
1                  0                 1                 0                  0
2                  0                 0                 1                  0
3                  1                 0                 0                  0
4                  1                 0                 0                  0
5                  0                 0                 1                  0
6                  1                 0                 0                  0
7                  1                 0                 0                  0
8                  1                 0                 0                  0
9                  1                 0                 0                  0
10                 0                 0                 0                  0
11                 0                 0                 0                  0
12                 1                 0                 0                  0
13                 1                 0                 0                  0
14                 1                 0                 0                  0
15                 0                 0                 0                  1
16                 0                 0                 0                  0
17                 1                 0                 0                  0
18                 1                 0                 0                  0
19                 1                 0                 0                  0
20                 1                 0                 0                  0
21                 1                 0                 0                  0
22                 0                 1                 0                  0
23                 1                 0                 0                  0
24                 1                 0                 0                  0
25                 1                 0                 0                  0
26                 0                 1                 0                  0
27                 1                 0                 0                  0
28                 0                 0                 0                  0

    Location_india in  Location_india,in  Location_new york,ny
0                   0                  1                     0
1                   0                  0                     1
2                   0                  0                     1
3                   1                  0                     0
4                   0                  0                     0
5                   0                  1                     0
6                   0                  0                     1
7                   0                  0                     0
8                   0                  0                     1
9                   0                  1                     0
10                  0                  1                     0
11                  0                  1                     0
12                  0                  1                     0
13                  0                  0                     0
14                  0                  0                     0
15                  0                  0                     0
16                  0                  1                     0
17                  0                  0                     1
18                  0                  0                     1
19                  0                  0                     1
20                  0                  0                     1
21                  0                  0                     1
22                  0                  0                     1
23                  0                  0                     1
24                  0                  0                     1
25                  0                  0                     0
26                  0                  1                     0
27                  0                  1                     0
28                  0                  0                     0

**Q15. Consistent Rating Scale: Ensure a consistent rating scale in the Rating column. Should it be normalized or adjusted for uniform analysis?**